emacs_shell.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-28 Sun 20:02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="John Mosty">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org74ec998">1. Packages</a></li>
<li><a href="#orgfda8b57">2. Basic setups</a></li>
<li><a href="#orga177970">3. Backups</a></li>
<li><a href="#orge7d2ac9">4. Evil</a></li>
<li><a href="#org798680e">5. Dired</a></li>
<li><a href="#orgf124234">6. Helpful Ivy hydra</a></li>
<li><a href="#orga0f4ad5">7. Org</a></li>
<li><a href="#orgdfaa6fd">8. Custom var</a></li>
</ul>
</div>
</nav>
<p>
#+title emacs config for the shell env
</p>

<div id="outline-container-org74ec998" class="outline-2">
<h2 id="org74ec998"><span class="section-number-2">1</span> Packages</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; begin file

(require 'package)
(require 'org)

(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/"))
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
(add-to-list 'package-archives '("melpa-stable" . "http://stable.melpa.org/packages/"))
(add-to-list 'package-archives '("elpa" . "https://elpa.gnu.org/packages/"))

(setq package-enable-at-startup nil)
(package-initialize)

(require 'use-package-ensure)
(setq use-package-always-ensure t)

(use-package auto-compile
  :config (auto-compile-on-load-mode))

(setq load-prefer-newer t)

(load-file "~/.emacs.d/sensible-defaults.el")
(sensible-defaults/use-all-settings)
(sensible-defaults/use-all-keybindings)

(use-package no-littering)
(server-start)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgfda8b57" class="outline-2">
<h2 id="orgfda8b57"><span class="section-number-2">2</span> Basic setups</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Make ESC quit prompts
(global-set-key (kbd "&lt;escape&gt;") 'keyboard-escape-quit)
(use-package diminish)
(setq global-hl-mode t)
(setq user-full-name "John Mosty"
      user-mail-address "dubs.mosty@gmail.com"
      calendar-latitude 30.32
      calendar-longitude -97.71
      calendar-location-name "Austin, TX")

  (column-number-mode)
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'visual)
  ;; Disable line numbers for some modes
  (dolist (mode '(term-mode-hook
	      shell-mode-hook
	      eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(defun hrs/kill-current-buffer ()
  "Kill the current buffer without prompting."
  (interactive)
  (kill-buffer (current-buffer)))

(global-set-key (kbd "C-x k") 'hrs/kill-current-buffer)
(winner-mode)
(global-set-key (kbd "&lt;f5&gt;") 'org-capture)
(global-set-key (kbd "&lt;f4&gt;") 'cfw:open-org-calendar)
(global-set-key (kbd "C-c j") 'org-journal-new-entry)

</pre>
</div>
</div>
</div>
<div id="outline-container-orga177970" class="outline-2">
<h2 id="orga177970"><span class="section-number-2">3</span> Backups</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7d2ac9" class="outline-2">
<h2 id="orge7d2ac9"><span class="section-number-2">4</span> Evil</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package evil
    :init
    (setq evil-want-abbrev-expand-on-insert-exit nil
	  evil-want-keybinding nil)
    :config
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :config
    (setq evil-collection-mode-list
	  '(ag dired magit mu4e which-key))
    (evil-collection-init))

  (use-package evil-surround
    :config
    (global-evil-surround-mode 1))

  (use-package evil-org
    :after org
    :config
    (add-hook 'org-mode-hook 'evil-org-mode)
    (add-hook 'evil-org-mode-hook
	      (lambda () (evil-org-set-key-theme)))
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))
</pre>
</div>
</div>
</div>
<div id="outline-container-org798680e" class="outline-2">
<h2 id="org798680e"><span class="section-number-2">5</span> Dired</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
;;  :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))

(add-hook 'dired-mode-hook
      (lambda ()
	(dired-hide-details-mode)))

(use-package dired-single)

;;(use-package dired-open
;;  :config
  ;; Doesn't work as expected!
  ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
;;  (setq dired-open-extensions '(("png" . "feh")
;;                                ("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf124234" class="outline-2">
<h2 id="orgf124234"><span class="section-number-2">6</span> Helpful Ivy hydra</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package ivy-hydra
  :defer t
  :after hydra)

(use-package ivy
  :diminish
  :config
  (ivy-mode 1))

(use-package counsel)
(use-package swiper)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
;; enable this if you want `swiper' to use it
;; (setq search-default-mode #'char-fold-to-regexp)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "&lt;f6&gt;") 'ivy-resume)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "&lt;f1&gt; f") 'counsel-describe-function)
(global-set-key (kbd "&lt;f1&gt; v") 'counsel-describe-variable)
(global-set-key (kbd "&lt;f1&gt; o") 'counsel-describe-symbol)
(global-set-key (kbd "&lt;f1&gt; l") 'counsel-find-library)
(global-set-key (kbd "&lt;f2&gt; i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "&lt;f2&gt; u") 'counsel-unicode-char)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(global-set-key (kbd "C-M-j") 'counsel-switch-buffer)
(define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)

(use-package ivy-rich
 :init
 (ivy-rich-mode 1))

(use-package avy
  :diminish
  :bind*
  ("C-;" . evil-avy-goto-char-2))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

</pre>
</div>
</div>
</div>
<div id="outline-container-orga0f4ad5" class="outline-2">
<h2 id="orga0f4ad5"><span class="section-number-2">7</span> Org</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun jwm/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
  :hook (org-mode . jwm/org-mode-setup)
  :config
  (setq org-ellipsis "..."))

(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

(defun jwm/org-mode-visual-fill ()

  (setq visual-fill-column-width 100
	visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . jwm/org-mode-visual-fill))

(setq scroll-conservatively 100)
(setq kill-whole-line t)
(setq kill-read-only-ok t)
(setq require-final-newline t)
(setq echo-keystrokes 0.1)
(setq focus-follows-mouse t)

(setq org-default-notes-file (concat org-directory "/notes.org"))

 (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

(defun air-org-skip-subtree-if-habit ()
  "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
  (let ((subtree-end (save-excursion (org-end-of-subtree t))))
    (if (string= (org-entry-get nil "STYLE") "habit")
	subtree-end
      nil)))

(defun air-org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.

PRIORITY may be one of the characters ?A, ?B, or ?C."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
	(pri-value (* 1000 (- org-lowest-priority priority)))
	(pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
	subtree-end
      nil)))

(setq org-agenda-custom-commands
      '(("d" "Daily agenda and all TODOs"
	 ((tags "PRIORITY=\"A\""
		((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "High-priority unfinished tasks:")))
	  (agenda "" ((org-agenda-ndays 1)))
	  (alltodo ""
		   ((org-agenda-skip-function '(or (air-org-skip-subtree-if-habit)
						   (air-org-skip-subtree-if-priority ?A)
						   (org-agenda-skip-if nil '(scheduled deadline))))
		    (org-agenda-overriding-header "ALL normal priority tasks:"))))
	 ((org-agenda-compact-blocks t)))))

(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key "\C-cl" 'org-store-link)
(define-key global-map "\C-cL" 'org-occur-link-in-agenda-files)
(global-set-key (kbd "&lt;home&gt;") 'beginning-of-buffer)
(global-set-key (kbd "M-o") 'other-window)

(set-window-scroll-bars (minibuffer-window) nil nil)
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))

(setq org-capture-templates
      '(("j" "Journal entry" plain (function org-journal-find-location)
	 "** %(format-time-string org-journal-time-format)%^{Title}\n%i%?"
	 :jump-to-captured t :immediate-finish t)
	("t" "Tasks" entry (file+headline "" "Tasks")
	 "*** TODO %?\n%U\n %a %i" :prepend t)
	("T" "Tasks with ClipBoard" entry (file+headline "" "Tasks")
	 "*** TODO %?\n%U\n   %^C" :prepend t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdfaa6fd" class="outline-2">
<h2 id="orgdfaa6fd"><span class="section-number-2">8</span> Custom var</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(org-agenda-files (quote ("~/org/habits.org" "~/org/notes.org")))
 '(org-agenda-include-diary t)
 '(org-agenda-show-all-dates t)
 '(org-agenda-skip-deadline-if-done t)
 '(org-agenda-skip-scheduled-if-done t)
 '(org-agenda-skip-timestamp-if-done t)
 '(org-agenda-start-on-weekday nil)
 '(org-agenda-sticky t)
 '(org-agenda-tags-todo-honor-ignore-options nil)
 '(org-capture-templates t t)
 '(org-clock-into-drawer "LOGBOOK")
 '(org-closed-keep-when-no-todo nil)
 '(org-enforce-todo-checkbox-dependencies t)
 '(org-enforce-todo-dependencies t)
 '(org-hide-emphasis-markers t)
 '(org-log-done (quote time))
 '(org-log-done-with-time t)
 '(org-log-into-drawer t)
 '(org-return-follows-link t)
 '(org-special-ctrl-a/e t)
 '(org-special-ctrl-k t)
 '(org-todo-keywords (quote ((type "TODO(t)" "DONE(d!)"))))
 '(org-todo-state-tags-triggers nil)
 '(org-use-fast-todo-selection (quote auto))
 '(pdf-view-midnight-colors (cons "#f8f8f2" "#282a36"))
 '(rustic-ansi-faces
   ["#3F3F3F" "#CC9393" "#7F9F7F" "#F0DFAF" "#8CD0D3" "#DC8CC3" "#93E0E3" "#DCDCDC"])
 '(tab-bar-mode t)
 '(tool-bar-mode nil)
 '(vc-annotate-background nil)
 '(vc-annotate-background-mode nil))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(counsel--mark-ring-highlight ((t (:underline "cyan"))))
 '(lazy-highlight ((t (:box (:line-width 2 :color "grey75" :style released-button) :underline t))))
 '(magit-diff-file-heading-highlight ((t (:underline t))))
 '(magit-section-highlight ((t (:background "brightblack" :underline nil)))))

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Mosty</p>
<p class="date">Created: 2021-03-28 Sun 20:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
